public/programming/notes/mental-map-of-computer-science.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>
<div id="outline-container-org6310cca" class="outline-2">
<h2 id="org6310cca">Mental Map of Computer Science</h2>
<div class="outline-text-2" id="text-org6310cca">
<p>
Computer Science is a very broad field, which gets lost in the
details. The more specific the thing you are working on, the more
specific knowledge you will have to learn - and its a big rabbit
hole. For every job you use different technologies, programming
languages, frameworks, build systems etc. Heck, a lot of knowledge
will become irrelevant in a very short amount of time. Therefore I
belive it is impossible and unnecessary to learn all there is to know,
then how are we supposed to program computers in an useful way?
</p>

<p>
I think there is a general mental model or map, or an approach or
workflow, that we learn when working with computer that is fundamental
to everything we do. This is what's important to understand and
master, as it will help you tremendously when you face a problem you
have never encountered before (which happens in the real world).
</p>

<p>
Let's make some examples of problem areas you may encounter:
</p>

<ul class="org-ul">
<li>graphics: how do we render a scene on a screen?</li>
<li>compilers: how do we convert structured bytes into another
structure?</li>
<li>database: how do we store and query data?</li>
<li>network: how do we make different machines communicate?</li>
<li>cryptogrphy: how do we secure communication?</li>
<li>compression: how do we store data such that it takes less space?</li>
<li>rng: how do we generate (pseudo) random numbers?</li>
<li>AI: how do we make the machine learn a pattern?</li>
<li>IOT: how do we make a machine interact with its physical
environment?</li>
<li>&#x2026;</li>
</ul>

<p>
Notice that the implementation really does not matter in the study of
these questions. We could try to propose a design of a solution, yet
the implementation is the actual solution and the real truth. The only
way we can assert that something works is by implementing and running
it. <b>Implementation is as important as design</b>.
</p>

<p>
Notice also that many problems have already been solved in most cases,
and others are still in development. The most difficult problem is to
find which problem is worth working on.
</p>

<hr />

<p>
Travel: <a href="notes.html">Programming Notes</a>, <a href="../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
